Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ནས་ དེ་དག་ ཐོས་ ནས་ ཀླུ་ རབ་ འཇོམས་ ལ་སོགས་པ །_ ཀླུ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ ག་ལ་ བ་ དེར་ མེ་ཆར་ ལྟར་ འབེབས་པ ས་ མངོན་པར་ འཚེད་པ ར་ བྱེད་ དོ །_།
en: $230 “When they hear these words, Pramatha and other such nāga kings will bear down on the nāga kings Vāsuki, Takṣaka, on so on, with a boiling rain of fire.

source: ཀླུ་ དེ་དག་ གིས་ ཀྱང་ མེ འི་ ཆར་ ཆེན་པོ་ འབེབས་ ལ་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱང་ གཡུལ་ ཆེན་པོ་ འགྱེད་ དེ །_
en: Then, as the nāgas bring down great rains of fire upon each other, the gods and asuras will clash in an enormous battle.

source: དེ་ནས་ ཡང་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱས་ སོ །_།
en: $231 “In the end, the gods will defeat the asuras.

source: དེ་ནས་ དེ་དག་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_། འཇིགས་ ཤིང་ བཞིན་ མོག་མོག་པོ ར་ གྱུར་པ་ སྐྱབས་ འདོད་པ་ ཀུན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེ་ཉིད་ དུ་ འདོང་བ ར་ བྱེད་ དོ །_།
en: Frightened, pale, and looking for protection, the asuras will come before the asura ruler Rāhu.

source: དེ་ནས་ སྒྲ་གཅན་ གྱིས་ དེ་དག་ མཐོང་ ནས་ ཡང་ འདི་ལྟར་ བདག་ འདི་ ན་ གནས་ ན་ ལྷ་མ་ ཡིན་ ཁྱེད་ཅག་ རྣམས་ ལ་ ཅི་ཞིག་ གནོད །_།
en: When he sees them, Rāhu will say, ‘Asuras, when I am here, what could possibly hurt you?

source: བདག་ གཅིག་པུ ས་ ལྷ་ རྣམས་ དབང་པོ་ དང་ བཅས་པ་ བཅོམ་ སྟེ །_ ལྷ འི་ འཇིག་རྟེན་ ཐམས་ཅད་ བདག་ཅག་ གིར་ བྱ་ན་ ཁྱེད་ དང་ འཁོད་པ ས་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས །_
en: I alone can defeat the gods and their ruler, and thus conquer the entire world of the gods, so I need not say what will happen if we fight together.

source: ལྷ འི་ དཔུང་ འདི་དག་ ཀྱང་ ཆེན་པོ་ མ་ ཡིན་ ན །_
en: The army of the gods is not that large.

source: གྲོགས་པོ་ དག་ཅི་ གནོད །_
en: Therefore, friends, what could hurt you?

source: འདི་ལྟར་ བདག་ གིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ །_ མེ་ཏོག་ ཕྲེང་ དང་ །_ རབ་དགོད་ དང་ །_ ཐགས་ བཟངས་ རིས་ དག་ ལ་ སྦྲན་ ལ་ བདག་ཉིད་ ཀྱིས་ ལྷ་ རྣམས་ ལས་ རྒྱལ་བ ར་ བྱ འོ་ ཞེས་ སྨྲས་ སོ །_།
en: I shall call on the asura kings Firm, Puṣpamāla, Overjoyed, and Vemacitrin, and together we will defeat the gods.’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་ [31b] པོ་ མེ་ཏོག་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་དགོད་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཐགས་ བཟངས་ རིས་ ག་ལ་བ་ དེར་ རིངས་པ ར་ སོང་ སྟེ་ ཕྱིན་ ནས དེ་དག་ ལ་ འདི་ལྟར་ ལྷ་ འདི་དག་ ཐམས་ཅད་ དང་ །_ རྒྱལ་ཆེན་ བཞི་པ་ ཐམས་ཅད་ བདག་ཅག་ གི་ ཕྱིར་ འོང་ གིས །_
en: $232 “At this point, the asura ruler Rāhu will go swiftly before the asura rulers Firm, [31.b] Puṣpamāla, Overjoyed, and Vemacitrin. There, he will tell them, ‘All those gods are bearing down on us, together with the gods of the realm of the Four Great Kings.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ འདི་དག་ ཀུན་ཤེས་ ནས་ ལན་ བྱ་བ་ གང་ཡིན་པ་ ལ་སོ་ སོར་ སོམས་ ཤིག་ ཅེས་ སྨྲས་ སོ །_།
en: With this in mind, think carefully about what sort of reply the asura rulers should deliver.’

source: དེ་ནས་ ཚིག་ དེ་ ཐོས་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཀུན་ གྱིས་ སྒྲ་གཅན་ དེ་ ལ་ འདི་ལྟར་ ལྷ་ རྣམས་ དང་ གཡུལ་འགྱེད་ དུ་ བདག་ཉིད་ ཐམས་ཅད་ ཀྱིས་ བདག་ཅག་ འདི་དག་ འཁོད་ ཅིང་ བདག་ཅག་ རྟོག་པ ར་ བྱེད་ ཀྱིས་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ ཀཽ་ཤི་ཀ་ ལ་སོགས་པ་ དང་ བཅས་པ་ ལ་བར་ ཆད་ བྱ་བ་ དང་ །_ གང་ གིས་ ལྷ་མ་ ཡིན་ རྣམས་ འབྱུང་བ ར་ བྱ་བ འི་ ཕྱིར་ ཁྱོད་ སོང་ ཤིག་ ཅེས་ སྨྲས་ སོ །_།
en: $233 “When they hear these words, all the asura rulers will reply to Rāhu, ‘We are ready and willing to meet the gods in battle. We must now go ahead and stop the gods of the Heaven of the Thirty-Three, including Kauśika. We must ensure that the asuras prevail. So please, proceed!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ ག་ལ་བ་ དེར་ བདག་ཉིད་ གཡུལ་འགྱེད་ དུ་ སོང་ སྟེ །_
en: $234 “The asura Rāhu will then return to the field where the battle between the gods and the asuras is raging.

source: དེ་དག་ མཐོང་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་ ལྷ་མ་ ཡིན་ རྣམས་ ལ་ ཀྱེ་མ་ ལྷ འི་ སྟོབས་ རབ་ཏུ་ ཆེ འོ །_།
en: When he sees the asuras, the asura ruler will tell them,

source: ཀྱེ་མ་ ལྷ་མ་ ཡིན་ རྣམས་ ལྷ འི་ སྟོབས་ རབ་ཏུ་ ཆེ་ སྟེ །_
en: ‘Ah, the forces of the asuras are much greater than those of the gods.

source: གཡུལ་འགྱེད་ པར་ ལྷ་ འཁོད་པ་ འདི་དག་ ལ་ ཕྱིར་ བརྒལ་བ ར་ མི་ ནུས་ སོ་ ཞེས་ སྨྲས་ སོ །_།
en: The gods assembled for battle here will prove unable to resist us.’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ མཚོན་ཆ་ དང་ ལག་ཆ་ ཆར་ ལྟར་ འབེབས་ ཤིང་ གཡུལ་འགྱེད་ དུ་ སོང་ ངོ་ །_།
en: $235 “The asura ruler Rāhu will then send forth a rain of weapons and arms, and thus charge forward to meet the gods in battle.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དེ་ལྟ ར་ རྒྱུག་པ་ མངོན་པར་ མཐོང་ ནས །_ ཀླུ་ དེ་དག་ ཡང་ ལྷན་ཅིག་ ཏུ་ མེ་ཆར་ ལྟར་ མངོན་པར་ འབེབས་ ཤིང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ སྒྲ་གཅན་ གཞོམ་པ འི་ ཕྱིར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: When the gods see the asura ruler Rāhu racing toward them, they and the nāgas will rush to meet him and bring down a rain of fire to destroy Rāhu.

source: དེ་ནས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ གི་ གཡུལ་ ཆེན་པོ་ མཚོན་ཆ་ དང་ །_ ལག་ཆ་ དང་ །_ རྡོ་རྗེ་ ཆར་ ལྟར་ འབེབས་ ཤིང་ མཚུངས་པ ར་ གཡུལ་ བཀྱེ་བ་ དང་ །_
en: With weapons, arms, and vajras pelting down like rain, a great battle between the gods and the asuras ensues.

source: དེ་དག་ གང་ གི་ ཚེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ །_ བྲམ་ཟེ ར་ འཛིན་པ །_ རིགས་ ཀྱི་ རྒན་རབས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ བྱུང་བ་ དེ འི་ ཚེ་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ བྱེད་ དོ །_།
en: $236 “If at that time people are righteous and follow the Dharma, respect mendicants and brahmins, and follow their elders, the gods will defeat the asuras.

source: གལ་ཏེ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ་ དག་ [32a] བྱུང་བ་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ལྷ་ རྣམས་ ཕམ་པ ར་ བྱེད་ དེ །_
en: If, however, people are unrighteous and do not follow the Dharma, [32.a] the asuras will defeat the gods.

source: དེ་ལྟ ར་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ ཆེན་པོ་ འགྱེད་པ་ ནི །_ ཆོས་ དང་ ཆོས་མ་ ཡིན་པ་ ཁོ་ན་ ལ་ རག་ ལས་པ་ ཡིན་ ནོ །_།
en: Thus, the war between gods and asuras depends on nothing but Dharma and non-Dharma.

source: དེ་ནས་ གང་ གི་ ཚེ་ལྷ་མ་ ཡིན་ རྒྱལ་ ཞིང་ལྷ་ ཕམ་པ ར་ གྱུར་པ་ དེ འི་ ཚེ་ ལྷ་ རྣམས་ ཕན་ཚུན་ དུ་ ལྷ་ དག་ ཆོས་ ལ་ སོམས་ ཤིག _། ལྷ་ དག་ ཆོས་ གཙོ་བོ ར་ གྱིས་ ཤིག _།
en: $237 “When the asuras are victorious and defeat the gods, the latter will tell each other, ‘Gods, think of the Dharma.

source: ལྷ་ རྣམས་ ནི་ ཆོས་ ཀྱིས་ རྒྱལ་བ ར་ འགྱུར་ རོ་ ཞེས་ བརྗོད་ དོ །_།
en: Gods, let the Dharma be what matters most.’

source: དེ་ནས་ ཆོས་ ཡིད་ ལ་ བྱས་ ཤིང་ ཆོས་ ལ་ དད་པ་ བསྐྱེད་པ འི་ ལྷ་ རྣམས་ ཡང་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: While thus keeping the Dharma in mind and arousing faith in the Dharma, the gods will go to where the asuras dwell.

source: དེ་ནས་ ཆོས་ ཀྱིས་ བསྐྱབས་པ འི་ ལྷ་ རྣམས་ གཟི་བརྗིད་ བརྒྱ་ འགྱུར་ དུ་ འབྱུང་ སྟེ །_ དེ་ལྟ ར་ དེ་དག་ གཟི་བརྗིད་ ཀྱིས་ འབར་བ་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ ཤིན་ཏུ་ སྒྱིད་ལུག་པ་ རྣམས་ ལ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ ས་ འདི་སྐད་ ཅེས་
en: Protected by the Dharma, the splendor of the gods will increase a hundredfold, and when the asuras behold them, blazing with glory, they will become totally discouraged. $238 “At that point, the asura ruler will say to the downcast asuras,

source: ཁྱེད་ ཅི་སྟེ་ སྒྱིད་ལུག _། འདི་དག་ ནི་ བདག་ཅག་ ལས་ གཟི་བརྗིད་ དམ །_ མཚོན་ཆ འམ །_ ལག་ཆ འམ །_ དཔུང་སྟོབས་ སམ །_ ཕལ་ཆེ་བ་ ཁྱད་ ཞུགས་པ་ མེད་ དེ དེ་དག་ ལ་ ཁྱེད་ ཅི་སྟེ་ སྒྱིད་ལུག་ ཅེས་ སྨྲས་ སོ །_།
en: ‘Why so sad? These gods are no better than us in terms of splendor, weaponry, arms, or military prowess. So why do you feel so disheartened?’

source: དེ་ནས་ དེ འི་ ཚིག་ དེ་ ཐོས་ ནས་ ཡང་ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ ལ་སོགས་པ །_ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ ཕྱིར་ལོག་ སྟེ་ འོང་ ངོ་ །_།
en: Thus, the asuras of the realm of Rāhu and the rest will return to fight the gods.

source: དེ་ནས་ ལྷ་ཆོས་ ཀྱིས་ རྒྱས་པ འི་ ལུས་ཅན་ དེ་དག་ ཐམས་ཅད་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ ཤུགས་ མྱུར་བ ར་ རྒྱུག་པ ར་ བྱེད་ དེ །_ ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ ཕན་ཚུན་ འདྲེས་ ནས་ གཡུལ་འགྱེད་ དོ །_།
en: Meanwhile, with their bodies nourished by the Dharma, the gods will rush forth to confront the asuras, and thus the two sides will attack each other and wage combat once again.

source: དེ་དག་ གི་ ནང་ ན་ སྒྲ་གཅན་ སྟོབས་ཆེན་པོ ར་ གནས་ ཏེ །_ རི་རབ་ གཉིས་པ་ ལྟ་བུ ར་ གནས་ སོ །_།
en: $239 “In the midst of the battle, Rāhu will remain powerful, like a second Mount Sumeru.

source: དེ་ ཆོས་ཉིད་ ཀྱི་ མཐུ ས་ ལྷ་ རྣམས་ ཀྱིས་ ཕམ་པ ར་ བྱེད་ དེ །_ སྐྱོབ་པ་ རྣམས་ ཀྱི་ ནང་ ན་ ཆོས་སྐྱོབ་པ་ མཆོག་ ཡིན་ ནོ །_། སྣང་བ་ རྣམས་ ཀྱི་ ནང་ ན་ ཆོས་ སྣང་བ་ མཆོག་ ཡིན་ ནོ །_།
en: Still, it is the nature of things that the asuras will be defeated because among all forms of protection, the protection of the Dharma is supreme, and among all forms of splendor the splendor of the Dharma is supreme.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ ལ་སོགས་པ་ ལྷ་མ་ ཡིན་ ཕམ་པ་ རྣམས་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ ཀུན་ ནས་ སྒྱིད་ལུག་པ་ རྣམས་ དེ་ནས་ ཡང་ དབུགས་ཕྱུང་ སྟེ །_
en: $240 “When Rāhu and the other asuras see themselves on the brink of defeat, Rāhu will once more attempt to inspire the dejected asuras, saying,

source: འདི་སྐད་ ཅེས་ ལྷ་མ་ ཡིན་ དག་ཅི་ སྟེ་ འབྲོས །_
en: ‘Asuras, why do you flee?

source: ལྷ་མ་ ཡིན་ འདི་དག་ མི་ ངན་པ འི་ ས ར་ ཅི་སྟེ་ གནས །_
en: Why should asuras find themselves at the level of inferior people?

source: ལྷ་ ནི་ ལྷ་མ་ ཡིན་ དུ་མ འི་ ནང་ ན་ དཔའ་བོ་ མ་ ཡིན །_ ལག་ཆ་ ཐོགས་པ་ མ་ ཡིན །_
en: The gods are less heroic than so many asuras, and they cannot compete with our military devices and terrifying weapons.

source: མཚོན་ཆ ས་ འཇིགས་པ་ མ་ ཡིན་ གྱིས་ ཕྱིར་ལོག་ སྟེ་ [32b] འཁོད་ ཅིག _། འདི་དག་ གིས་ ཅི་སྟེ་ གནོད་ ཅེས་ སྨྲས་ སོ །_།
en: So, come back and take up your positions! [32.b] What harm could they possibly do to us?’

source: དེ་ནས་ དེ འི་ ཚེ་ དེ་ ཐོས་ ནས་ ཡང་ ལྷ་མ་ ཡིན་ རྣམས་ གཡུལ་འགྱེད་ དུ་ ཕྱིར་ལོག་ གོ །_།
en: Hearing those words, the asuras will once more return to fight in the war.

source: དེ་ནས་ ཡང་ དེས་ གཟེངས་བསྟོད་ ཅིང་ མགུ་བ ར་ བྱས་པ །_ ང་རྒྱལ་ གྱིས་ ཁེངས་པ་ རྣམས །_ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ གཡུལ་ བཀྱེ་བ་ དང་ །_ དེ་ནས་ ཡང་ འབྲོས་ སོ །_།
en: Encouraged, with renewed confidence and infatuated by pride, the asuras will again sally forth to battle the gods, but once again they will end up fleeing.

source: དེ་ནས་ སྒྲ་གཅན་ ནི་ ལྷ་མ་ ཡིན་ དེ་དག་ ཀུན་ གྱི་ དང་པོ་ ཁོ་ན་ ལ་ འདུག་ སྟེ །_ དེ་ དང་པོ་ ཁོ་ན ར་ འདུག་ སྟེ །_ དེ་ ལ་ རྟེན །_ དེས་ སྐྱོབ །_ དེ་ ལ་ འཁོར་བ འི་ ལྷ་མ་ ཡིན་
en: $241 “Rāhu will then show himself as the leader of all the asuras. As their leader, all the asuras obey him, rely on him, are protected by him, and surround him.

source: དེ་དག་ ཐམས་ཅད་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ ག་ལ་བ་ དེར་ སྒྲ་གཅན་ གྱི་ མཐུ་ ལ་ རྟེན་པ །_ སྟོབས་ སྐྱེས་པ་ དག་ རྒྱུག་པ ར་ བྱེད་ ཅིང་ །_
en: Therefore, they will again charge toward the gods of the realm of the Four Great Kings, encouraged and reinvigorated by the strength of Rāhu.

source: འདི་ལྟར་ བདག་ཅག་ གི་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ འདི་ དང་པོ་ ཁོ་ན་ ལ་ ཞུགས་ པས་ ལྷ་ རྣམས་ དབང་པོ་ དང་ བཅས་པ་ ཡང་ ཐུབ་པ ར་ འགྱུར་ ན རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ འབའ་ཞིག་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ སྙམ་ སེམས་ སོ །_།
en: ‘Our ruler Rāhu strides ahead of everyone. Since he is capable of crushing all the gods and their rulers single-handedly, he can surely destroy the gods of the realm of the Four Great Kings.’

source: དེ་ནས་ ཡང་ ཕན་ཚུན་ རྟོག་ ཅིང་ མཚོན་ཆ འི་ ཚོགས་ ཀྱི་ རྒྱུན་ གཅིག་ ལ་ གཅིག་ འདེབས་པ་ ན །_
en: With such thoughts, they examine each other and make sure that their weapons are distributed among them all.#244

source: སྒྲ་གཅན་ ཡང་ ལྷ་མ་ ཡིན་ རྣམས་ རྒྱལ་བ ར་ བྱ་ ཞིང་ལྷ་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ ལྷ་ ག་ལ་ འཁོད་པ་ དེར་ རྡོ་ རི་ ཙམ་ འཕེན་ ཅིང་ གནོད་པ ར་ བྱེད་ དོ །_།
en: $242 “To bring victory to the asuras and defeat to the gods, Rāhu will now begin to hurl rocks as large as mountains at the assembled gods.

source: དེ་ནས་ སྒྲ་གཅན་ དེ །_ དེ་ལྟ ར་ ལྷ་ རྣམས་ ལ་ རྡོ་ཆར་ ལྟར་ འབེབས་པ །_ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ གིས་ མངོན་པར་ མཐོང་ ནས །_
en: When the guardians of the world see how Rāhu is bombarding the gods, they will exclaim,

source: ལྷ་ རྣམས་ ལ་ སྒྲ་གཅན་ འདི་ ནི་ རྡོ་ཆར་ ལྟར་ འབེབས་པ ས་ བདག་ཅག་ ལ་ མངོན་པར་ གནོད་པ ར་ བྱེད་ ན །_
en: ‘The gods are being damaged by Rāhu, who hurls stones upon them!

source: ལྷ་ དག་ མཚོན་ཆ་ དང་ །_ ལག་ཆ་ ཆར་ ལྟར་ དབབ་པ་ རྣམས་ ཀྱིས་ དེ་ བཟློག་ ཅིང་ །_ འདི་ལྟར་ ཡང་ ལྷ་ རྣམས་ ལ་ གནོད་པ་ མེད་པར་ མཛོད་ ཅིག _། དེ་དག་ ལ་ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ གིས་ འདི་སྐད་ སྨྲས་ ནས །_
en: Now the gods must stop him with a downpour of weapons and arms. Rāhu must be stopped from harming the gods.’

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ སྒྲ་གཅན་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ ཁྲོ་བ འི་ ཤུགས་ ཀྱིས་ རྒྱུག་པ ར་ བྱེད་ དོ །_། དེ་ནས་ སྒྲ་གཅན་ དང་ །_ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ ཤིན་ཏུ་ སྤུ་ ཟིང་ ཞེས་ བྱེད་པ །_ རྡོ་ དང་ ལག་ཆ ར་ བསྲེས་པ འི་ གཡུལ་ བཀྱེའོ །_།
en: $243 “Furious, they will then race toward the asura ruler Rāhu to defeat him. What follows is an utterly hair-raising battle with rocks and weapons cascading down.

source: རྡོ་ཆར་ ལྟར་ འབེབས་པ་ དེས་ རྒྱ་མཚོ་ ཀུན་ ནས་ རབ་ཏུ་འཁྲུག་ པར་ བྱེད་ ཅིང་ །_
en: As the volley of rocks falls into the water, the ocean becomes extremely agitated.

source: ལྷ འི་ རྡོ་ཆར་ ལྟར་ འབེབས་པ་ རྣམས་ ཀྱིས་ ཀྱང་ །_ དེ་ལྟ ར་ རྒྱ་མཚོ་ ན་ གནས་པ འི་ སེམས་ [33a] ཅན་ འབུམ་ཕྲག་ དུ་མ་ དག་ གསོད་པ ར་ བྱེད །_ འཁྲུག་པ ར་ བྱེད །_ ཀུན་ ནས་ རྒྱ་མཚོ འི་ དཔུང་ འཁྲུག་པ ར་ བྱེད་ དོ །_།
en: The downpour of stones from the gods [33.a] ends up decimating many hundreds of thousands of beings that live in the ocean, thus causing great upheaval and mayhem among all the denizens of the sea.

source: དེ་ནས་ སྒྲ་གཅན་ དེ་ དང་ །_ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ གཡུལ་ ཆེན་པོ ར་ བཀྱེ་བ་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ མངོན་པར་ མཐོང་ ནས་ ངོ་མཚར་ ཆེ ར་ སྐྱེས་ ཏེ །_
en: As Rāhu and the guardians of the world battle on, the gods and asuras will watch. With amazement they will cry out,

source: ཀྱེ་མ་ གཡུལ་འགྱེད་པ་ རྣམས་ ཀྱི་ ནང་ ན་ འདི་ ནི་ གཡུལ་ ཆེན་པོ་ ཡིན་ ནོ་ ཞེས་ བརྗོད་ དོ །_།
en: ‘Ah, this truly is the mother of all wars!’

source: དེ་ནས་ གང་ གི་ ཚེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ བྱུང་བ་ དེ འི་ ཚེ་ ལག་ཆ་ དང་ དཔུང་ དང་ འཇིགས་ པར་ བྱ་བ་ ཀུན་ མེད་ ཀྱིས་ ཀྱང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ཕམ་པ ར་ འགྱུར །_
en: $244 “If at that time people are righteous and follow the Dharma, the asura ruler Rāhu will be defeated even without any recourse to weapons, armies, or terrorism.

source: གལ་ཏེ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ འི་ སྐྱེ་དགུ་ དག་ བྱུང་བ་ དེ འི་ ཚེ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ མངོན་པར་ མཐོ་བ ར་ འགྱུར་ ཏེ །_ ལྷ་ རྣམས་ ནི་ མ་ ཡིན་ ནོ །_།
en: If, however, people are unrighteous and do not follow the Dharma, the asura ruler Rāhu will prevail and not the gods.

source: དེ་ལྟ ར་ འདི་དག་ ཐམས་ཅད་ ནི་ ཆོས་ གཙོ་བོ་ ལས་ གྱུར་ ཏེ །_ གློ་བུར་པ་ ནི་ མ་ ཡིན་ ནོ །_།
en: Thus, all of this is primarily determined by the Dharma and is not accidental.

source: དེ་ནས་ གང་ གི་ ཚེ་ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ དཔུང་ དང་ མཐུ་རྩལ་ ཉམས་ ཏེ །_ ཕམ་པ ར་ གྱུར་པ་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ ཤིན་ཏུ་ ཡི་ ཆད་པ་ རྣམས་ ཀྱིས་ ཡང་ སྨྲས་པ །_
en: $245 “When the army and the powers of the asura ruler Rāhu flounder and face imminent defeat, those asuras still full of trust will say,

source: ལྷ་མ་ ཡིན་ འདི་དག་ ཅི་སྟེ་ འབྲོས །_
en: ‘Why should the asuras flee?

source: རྒུད་པ འི་ ཆོས་ མང་པོ་ སྒྲུབ་པ་ ནི་ བདག་ཅག་ རྒུད་པ ར་ གྱུར་ ཏེ །_
en: If we allow ourselves to lose this battle, we will fall apart.

source: ཉོན་མོངས་པ་ དེས་ཆོག་ གོ་ ཆོག་ གོ །_།
en: Enough of this despair! Enough!

source: བདག་ཅག་ རང་ གི་ གནས་ རྣམས་ སུ་ ཡང་ བདེ་བ འམ །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ནང་ དུ་ ཡང་ ཡིད་ བདེ་བ འི་ ངོ་བོ ར་ མི་ ནུས་ ཏེ །_
en: At home we do not find any happiness and our minds will not be happy among the asuras.

source: བློ་ དེ་ལྟ་ བུ་ མ་ བྱེད་པ ར་ བློ་ མཐུ་རྩལ་ དང་ བཅས་པ ར་ གྱིས་ ཤིག _། རང་ གི་ གནས་ སུ་ འགྲོ་ མ་ འདོད་པ ར་ སླར་ ལོག་ ཤིག་ སླར་ ལོག་ ཤིག _།
en: Therefore, we must not think in this way. We must summon our courage! You need to stop pining for home and get back here! Come back!’

source: དེ་ནས་ ཚིག་ དེ་ ཐོས་ ནས་ ཡང་ ལྷ་མ་ ཡིན་ ཐམས་ཅད་ འཇིག་རྟེན་ སྐྱོང་བ་ དག་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་ དུ་ བརྒྱུགས་ སོ །_།
en: $246 “When they hear this encouraging speech, all the asuras will rush back toward the guardians of the world.

source: དེ་ནས་ ཡང་ ཕན་ཚུན་ ལྷན་ཅིག་ རྡོ་ མཚུངས་པ་ མེད་པ་ ཆར་ ལྟར་ འབེབས་ ཤིང་ རི འི་ རྩེ་མོ ར་ གློག་ ཆར་ ལྟར་ འབྱིན་ ཏེ །_
en: The two parties will now hurl an unparalleled torrent of rocks at each other, and from the mountaintops they will let loose a barrage of lightning.

source: ཡུལ་ངན་ དུ་ བྱས་པ ར་ སྤུ་ ཤིན་ཏུ་ ཟིང་ ཞེས་ བྱེད་པ འི་ གཡུལ་ བཀྱེའོ །_།
en: In this way, they will fight a devastating and utterly hair-raising battle.

source: དེ་ནས་ ཡང་ ལྷ འི་ དཔུང་ གིས་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ ཕམ་པ ར་ བྱས་ སོ །_།
en: In the end, however, the gods will be victorious and the asuras will be defeated.

source: དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ དེ་དག་ ཐམས་ཅད་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: $247 “At that time the asuras will think,

source: ཀྱེ་མ་ ལྷ་ འདི་ རྣམས་ མཐུ་ཆེན་པོ་ དང་ ལྡན་པ་ ཡིན་ ནོ །_།
en: ‘Alas, the gods are extremely powerful.

source: འདི་ལྟར་ བདག་ཅག་ རང་ གི་ མཐུ་ བསྐྱེད་ [33b] པ་ དང་ །_ དེ་ བདག་ཅག་ གི་ དོན་ དང་ །_ བདེ་བ འི་ ཕྱིར་ དང་ །_ ཕན་པ ར་ བྱ་བ འི་ ཕྱིར་ གནས་ གཉིས་པ་ ན་ གནས་པ་ སྐར་ ཕྲེང་ གི་ བདག་པོ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ ལ་ སྐྱབས་ སུ་ དོང་བ ར་ བྱ འོ །_།
en: Thus, in order to regain our strength, [33.b] and be successful, happy, and preserve ourselves, let us seek refuge with Firm, the ruler of Star Garland, who lives on the second level.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དེ་ ནི་ རང་བཞིན་ གྱིས་ བརྟན་པ་ ཡིན་ ཏེ །_
en: The asura ruler Firm has a firm character.

source: ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ གཡུལ་ དུ་ དབང་པོ་ དང་ བཅས་པ ར་ བརྒྱ འམ །_ ཡང་ན་ སྟོང་ དུ་ སྟོབས་ ཀྱིས་ རྒྱལ་བ་ ཡིན་ ནོ་ སྙམ་ མོ །_། དེ་ནས་ དེ་ལྟ ར་ ལྷ་མ་ ཡིན་ གྱི་ གཙོ་བོ་ དེ་དག་ ཐམས་ཅད་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: In the war between gods and asuras, he is a hundred, or even a thousand times stronger than the gods, including their ruler.’

source: དེ་ནས་ དེ་དག་ ཐམས་ཅད་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དེ་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $248 “Thus, all the leaders of the asuras will go to meet the asura ruler Firm. They will then tell him,

source: ཀྱེ་མ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དག་ འདི་ལྟར་ ལྷ འི་ ཕྱོགས་ སྟོབས་ རབ་ཏུ་ ཆེ་ སྟེ །_ ལྷ་མ་ ཡིན་ སྒྲ་གཅན་ དང་ བཅས་པ་ རྣམས་ ཀྱིས་ ཕྱིར་ བརྒལ་བ ར་ མི་ ནུས་པ ས །_
en: ‘O ruler of asuras, the forces of the gods are very strong and no one, including the asura Rāhu, can repulse them.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ ས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ དཔུང་ བགྱི་བ་ དང་ །_ སྐྱབས་ བགྱི་བ་ དང་ །_ ཕ་རོལ་ གཞོམ་པ འི་ ཕྱིར་ དེ་དག་ ངེས་པ ར་ བགྱི་བ འི་ རིགས་ སོ །_།
en: Your Majesty, you must therefore be the guardian and savior of the asuras and ensure that our enemy is crushed.

source: ཁྱོད་ ཀྱི་ ལག་ ན་ མཚོན་ཆ་ ཡོད་པ ས་ ལྷ་ དག་ དབང་པོ་ དང་ བཅས་པ་ ཡང་ བདག་ཅག་ ལ་ ཕྱིར་རྒོལ་ བར་མི་ ནུས་ ཏེ །_ ཁྱོད་ ཀྱིས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ གཡུལ་ དུ་ རྒྱལ་བ་ མང་ དུ་ བརྙེས་པ་ ལགས་སོ །_།
en: No one—neither the gods and their ruler, nor we ourselves—can withstand the weapon that you wield, and with which you have achieved many a victory in the war between the gods and the asuras.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་དག་ ངེས་པ ར་ བཟློག་ ཏུ་ གསོལ །_
en: Your Majesty, we request that you decisively repel the enemy.

source: ལག་ ན་ མཚོན་ཆ་ ཆེན་པོ་ ཐོགས་པ །_ རང་ གི་ དཔུང་ དང་ མཐུ་རྩལ་ བསྐྱེད་ ཅིང་ ལྷ་ རྣམས་ ཕམ་པ ར་ བགྱི་བ འི་ ཕྱིར་བཟློག་ ཏུ་ གསོལ །_
en: Please brandish your arms and lead your forces and use your powers to conquer the gods.

source: ཁྱོད་ ཀྱིས་ བརྒྱ་བྱིན་ ཉིད་ ཀྱང་ བརྒྱ་ སྟོང་ དུ་ ཕམ་པ ར་ བགྱིས་ ཏེ །_
en: You can defeat even Śakra himself a hundred thousand times.

source: ལྷ་ དེ་ རྣམས་ ཁྱོད་ ཀྱི་ མཐུ་རྩལ་ གྱིས་ ཕམ་པ ར་ བགྱིས་པ་ ལགས་སོ །_།
en: Your strength and prowess will definitely defeat those gods.’

source: དེ་ནས་ བརྟན་པ ས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་དག་ ལས་ཚིག་ དེ་ ཐོས་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ག་ལ་བ་ དང་ །_ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ ག་ལ་བ་ དེར་ དོང་ སྟེ་ ཕྱིན་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དེ་དག་ ལ་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_།
en: $249 “When he hears these words, the asura ruler Firm will go before the asura rulers Puṣpamāla, Vemacitrin, and Overjoyed and say,

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ འི་ ཕྱོགས་ སྒྲ་གཅན་ དང་ བཅས་པ་ ལྷ་ རྣམས་ ཀྱིས་ ཕམ་པ ར་ བྱས་ ཏེ །_ ལྷ་ རྣམས་ ནི་ སྟོབས་ རབ་ཏུ་ ཆེ འོ །_།
en: ‘The forces of the asura rulers, including Rāhu, have been defeated by the gods, and the gods have become very powerful.

source: སྟོབས་ རབ་ཏུ་ ཆེ་བ ས་ བཟོད་པ ར་ དཀའ་ སྟེ །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ བཟོད་པ ར་ མི་ ནུས་ སོ །_།
en: Because they are so strong, they are hard to resist, and thus the asuras cannot withstand them.

source: གཡུལ་འགྱེད་ པར་ རྒྱལ་བ ར་ བགྱི་བ འི་ ཕྱིར་ དེ་ གནང་ བར་ [34a] མཛོད་ ཅིག _།
en: Please join the effort so that we can win this war.’ [34.a]

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ དང་ །_ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དེ་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_། ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བདག་ཅག་ འདི་དག་ ཁྱོད་ ཀྱི་ གྲོགས་ སུ་ འཁོད་པ་ ཡིན་ གྱིས་ ཁྱོད་ སོང་ ཤིག་ ཁྱོད་ སོང་ ཤིག _། བདག་ཅག་ གིས་ གྲོགས་ བྱས་པ ས་ ཁྱོད་ དང་ སྒྲ་གཅན་ དང་ བཅས་པ ས་ ལྷ་ ཐམས་ཅད་ ལས་ ཀྱང་ རྒྱལ་བ ར་ ནུས་ སོ །_།
en: $250 “To this the asura rulers Puṣpamāla, Vemacitrin, and Overjoyed will reply, ‘Your Majesty, we shall be there to assist you, so please go ahead. Please go ahead. We will be there to help, so that you and Rāhu will be able to defeat all the gods.’

source: དེ་ནས་ ཚིག་ དེ་ ཐོས་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དེ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ སོང་ ངོ་ །_།
en: $251 “When he has received this message, the asura ruler Firm will set out to meet Rāhu and join the war.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དེ་ མཐོང་ ནས་ ཤིན་ཏུ་ མགུ་ ཞིང་ མཐུ་རྩལ་ སྐྱེས་པ་ རྣམས་
en: When the asuras see the asura ruler Firm, they will become extremely happy and energized.

source: ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ མཚོན་ཆ་ དང་ །_ ལག་ཆ་ དང་ །_ མདའ་ དག་ འཕེན་ ཅིང་ འདེབས་པ་ ན་ ཐམས་ཅད་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གཉིས་ དང་ ལྷན་ཅིག་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Shooting and striking with various weapons, arms, and arrows, they will storm the gods. $252

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ དེ་དག་ མཐོང་ ནས་ འདི་སྐད་ ཅེས་ སྨྲས་ སོ །_། ལྷ་མ་ ཡིན་ དག་ འདི་ལྟར་ ཡང་ དང་ ཡང་ དུ་ བདག་ཅག་ རྣམས་ ཀྱིས་ ཕམ་པ ར་ བྱ་ འདོད་ དམ །_ དེ་ནས་ ཡང་ བརྩོན་འགྲུས་ ལ་ དམིགས་ ནས་
en: “When the gods see them advancing, they will say, ‘Do the asuras just want us to defeat them again and again?

source: དུད་འགྲོ འི་ འགྲོ་བ་ ངོ་བོ་ ཉིད་ ཀྱིས་ ཕམ་པ་ རྣམས་ ཡང་ འོང་བ ར་ བྱེད་ དོ །_། དེ་ནས་ དེ་ལྟ ར་ རིག་ ནས་ ལྷ་ ཤིན་ཏུ་ བརྩོན་འགྲུས་ བརྩམས་པ །_ མཚོན་ཆ་ དང་ ལག་ཆ་ སྣ་ཚོགས་ ཐོགས་པ་ དེ་དག་ ཐམས་ཅད་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེ་ཉིད་ དུ་ འགྲོས་ ཤིན་ཏུ་ མྱུར་བ ར་ འགྲོ་བ ར་ བྱེད་ དོ །_།
en: Here come those animals that, in spite of their diligence, are already defeated due to the very nature of things!’ $253 “With this understanding, the gods will muster all their fortitude. Brandishing their various arms and weapons, they will advance on the asuras with great speed.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ །_ སྒྲ་གཅན་ གྱིས་ འདི་སྐད་ སྨྲས་ སོ །_།
en: Seeing them advance, the asura rulers Firm and Rāhu will say,

source: ལྷ་ རྣམས་ བདག་ཅག་ གི་ སྟེང་ དུ་ འོངས་ ཏེ །_ ལྷ་ རྣམས་ གཡུལ་འགྱེད་ དུ་ འོང་ ངོ་ །_།
en: ‘The gods are upon us, the gods are coming to fight us.

source: བདག་ཅག་ གིས་ དེ་དག་ ངེས་པ ར་ གཡུལ་ འདི་ གཉིས་ ཀྱི་ བར་ དུ་ བཅུག་ སྟེ་ གཞོམ་པ ར་ བྱ འོ །_།
en: We shall flank them between our two troops and destroy them.’

source: དེ་ནས་ དེ་སྐད་ སྨྲས་ མ་ ཐག་ ཏུ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ །_ སྒྲ་གཅན་ ཕན་ཚུན་ རྒྱལ་བ ར་ འདོད་པ་ དག་ ལྷན་ཅིག་ ཏུ་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: Thus, with their hearts set on victory, the asura rulers Firm and Rāhu will jointly advance on the gods of the realm of the Four Great Kings.
